In [2]:
import sqlite3
import pandas as pd
import numpy as np

In [4]:
querry="""CREATE TABLE test (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);"""
querry

'CREATE TABLE test (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);'

In [10]:
con=sqlite3.connect('mydata.sqlite')
con.execute(querry)
con.commit()

In [12]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt="INSERT INTO test VALUES(?,?,?,?)"

In [13]:
con.executemany(stmt,data)

In [14]:
con.commit()

In [23]:
cursor=con.execute('select * from test')
rows=cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [24]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [26]:
import sqlalchemy as sqla
db=sqla.create_engine('sqlite:///mydata.sqlite')

In [27]:
pd.read_sql('select * from test',db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5